Revit 2027 API
BuiltInFailures.RoomFailures.RoomNotEnclosedLoadAreas Property
 [Room] is not in a properly enclosed region
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomNotEnclosedLoadAreas { get; }
Public Shared ReadOnly Property RoomNotEnclosedLoadAreas As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomNotEnclosedLoadAreas {
	FailureDefinitionId^ get ();
}
static member RoomNotEnclosedLoadAreas : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace